#  data analysis

### data analysis is a process of inspecting cleansing transforming and modelling data with the goal of discovreing useful information, informing conclusions,and supporting decision -making

## library(for data analysis)
### Numpy ,Satsmodel , Matlotlib , Scipy Pandas ,Seaborn , Sckit learn

#### read and write data structure csv,txt,JSON,Zip,Excel

## pandas
### Series 1D pandas.Series(data=[],index=[]) 
series have only single column with index


### DataFrame 2D pandas.DataFrame(data=[],index=[])
dataframe have multiple column(multidimentional) with index

In [3]:
import pandas as pd
df1=pd.read_csv("D:/python/tested.csv")
df10=df1
print(df1)

     PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]

In [3]:
df10.to_json("titanic.json",orient='index')
json=pd.read_json("titanic.json",orient='index')
print(type(json))
json

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,None,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,None,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,None,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,None,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,None,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,None,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,None,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,None,C

In [9]:


l1=[2,3,4,5,6,7,8,9]
s1=pd.Series(data=l1,index=[1,2,3,4,5,6,7,8])

l2=[4,5,6,7,8,9,0,1]
s2=pd.Series(data=l2,index=[1,2,3,4,5,6,7,8])
print(type(s1))
s1,s2

<class 'pandas.core.series.Series'>

(1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 1    4
 2    5
 3    6
 4    7
 5    8
 6    9
 7    0
 8    1
 dtype: int64)

In [10]:
print(s1[2])

3

In [11]:
# add()	Method is used to add series or list like objects with same length to the caller series
#Series.add(other, level=None, fill_value=None, axis=0)
s1.add(s2)

1     6
2     8
3    10
4    12
5    14
6    16
7     8
8    10
dtype: int64

In [12]:
# add()	Method is used to add series or list like objects with same length to the caller series
s1.sub(s2)

1   -2
2   -2
3   -2
4   -2
5   -2
6   -2
7    8
8    8
dtype: int64

In [13]:
# mul()	Method is used to multiply series or list like objects with same length with the caller series
s1.mul(s2)

1     8
2    15
3    24
4    35
5    48
6    63
7     0
8     9
dtype: int64

In [14]:
# div()	Method is used to divide series or list like objects with same length by the caller series
s1.div(s2)

1    0.500000
2    0.600000
3    0.666667
4    0.714286
5    0.750000
6    0.777778
7         inf
8    9.000000
dtype: float64

In [20]:
# sum()	Returns the sum of the values for the requested axis
print(s1.sum())
print(s2.sum())

44
40

In [24]:
#prod()	Returns the product of the values for the requested axis

#Series.prod(axis=None, skipna=None, level=None, numeric_only=None, min_count=0)

print(s1.prod())
print(s2.prod())

362880
0

In [25]:
print(s1.mean())

5.5

In [7]:
import pandas as pd
df=pd.DataFrame(data={
    "name":list("mukesh"),
    "char":list("123456")
})


df=df.add_prefix("_x")
df=df.add_suffix("_y")

df

  _xname_y _xchar_y
0        m        1
1        u        2
2        k        3
3        e        4
4        s        5
5        h        6

In [8]:
df.loc[::-1].reset_index(drop=True).head()

  _xname_y _xchar_y
0        h        6
1        s        5
2        e        4
3        k        3
4        u        2

In [10]:
pd.to_numeric(df.columns,errors="coerce")
df.dtypes

AttributeError: 'DataFrame' object has no attribute 'col_two'

In [24]:
dic = {"name":["cat","rat","bat","hen","cow"],
      "qty":[10,2,13,14,10]}
s2=pd.Series(dic)
print(s2)

name    [cat, rat, bat, hen, cow]
qty           [10, 2, 13, 14, 10]
dtype: object

In [26]:
#melt()
df3=pd.DataFrame({
    "days":[1,2,3,4,5,6],
    "eng":[8,12,4,5,7,4],
    "maths":[18,19,19,17,18,16]
})
df3

   days  eng  maths
0     1    8     18
1     2   12     19
2     3    4     19
3     4    5     17
4     5    7     18
5     6    4     16

In [29]:
pd.melt(df3)

   variable  value
0      days      1
1      days      2
2      days      3
3      days      4
4      days      5
5      days      6
6       eng      8
7       eng     12
8       eng      4
9       eng      5
10      eng      7
11      eng      4
12    maths     18
13    maths     19
14    maths     19
15    maths     17
16    maths     18
17    maths     16

In [30]:
pd.melt(df3,id_vars=["eng","maths"])

   eng  maths variable  value
0    8     18     days      1
1   12     19     days      2
2    4     19     days      3
3    5     17     days      4
4    7     18     days      5
5    4     16     days      6

In [34]:
pd.melt(df3,id_vars=["eng","maths"],var_name=["days"])

   eng  maths  days  value
0    8     18  days      1
1   12     19  days      2
2    4     19  days      3
3    5     17  days      4
4    7     18  days      5
5    4     16  days      6

In [6]:
import pandas as pd

df1=pd.DataFrame({
    "name":["mukesh","suresh","suraj","sanju","ravi","lucky","sandeep","sukesh"],
    "max marks":[20,20,20,20,20,20,20,20],
    "eng":[8,12,4,5,7,4,5,8],
    "maths":[18,19,19,17,18,16,1,6]
})
df1

      name  max marks  eng  maths
0   mukesh         20    8     18
1   suresh         20   12     19
2    suraj         20    4     19
3    sanju         20    5     17
4     ravi         20    7     18
5    lucky         20    4     16
6  sandeep         20    5      1
7   sukesh         20    8      6

In [32]:
s1=pd.Series(data=["mukesh","suresh","suraj","sanju","ravi","lucky","sandeep","sukesh"])
s1
s2=pd.Series(data=[18,19,19,17,18,16,1,6])
s2
s3=pd.Series(data=[8,12,4,5,7,4,5,8])

In [28]:
a=["mukesh","suresh","suraj","sanju","ravi","lucky","sandeep","sukesh"]
b=len(a)
print("series title")
for i in range(b):
    print(f"{i}",f"{a[i]}".rjust(10))
print(type(a))

series title
0     mukesh
1     suresh
2      suraj
3      sanju
4       ravi
5      lucky
6    sandeep
7     sukesh
<class 'list'>

In [35]:
s2.add(s3, level=None, fill_value=None, axis=0)

0    26
1    31
2    23
3    22
4    25
5    20
6     6
7    14
dtype: int64

In [36]:
s2.sub(s3, level=None, fill_value=None, axis=0)

0    10
1     7
2    15
3    12
4    11
5    12
6    -4
7    -2
dtype: int64

In [37]:
s2.mul(s3, level=None, fill_value=None, axis=0)

0    144
1    228
2     76
3     85
4    126
5     64
6      5
7     48
dtype: int64

In [38]:
s2.div(s3, level=None, fill_value=None, axis=0)

0    2.250000
1    1.583333
2    4.750000
3    3.400000
4    2.571429
5    4.000000
6    0.200000
7    0.750000
dtype: float64

In [48]:
print(s2.sum())
s3.sum()

114

53

In [53]:
print(s3.prod())
s2.prod()

2150400

190885248

In [54]:
print(s2.mean())
s3.mean()

14.25

6.625

In [55]:
print(s2.pow(s3))

0         11019960576
1    2213314919066161
2              130321
3             1419857
4           612220032
5               65536
6                   1
7             1679616
dtype: int64

In [57]:
print(s2.abs())
s3.abs()

0    18
1    19
2    19
3    17
4    18
5    16
6     1
7     6
dtype: int64

0     8
1    12
2     4
3     5
4     7
5     4
6     5
7     8
dtype: int64

In [59]:
s3.cov(s2)

2.964285714285714

In [60]:
s2.combine_first(s3)

0    18
1    19
2    19
3    17
4    18
5    16
6     1
7     6
dtype: int64

In [62]:
s2.count()

8

In [63]:
s3.count()

8

In [66]:
print(s2.size)
print(s1.size)

8
8

In [75]:
print(s1.is_unique)
print(s2.is_unique)
print(s3.is_unique)

True
False
False

In [77]:
print(s2.idxmax())
print(s3.idxmax())

1
1

In [78]:
print(s2.idxmin())
print(s3.idxmin())

6
2

In [80]:
print(s2.sort_values())
print(s1.sort_values())

6     1
7     6
5    16
3    17
0    18
4    18
1    19
2    19
dtype: int64
5      lucky
0     mukesh
4       ravi
6    sandeep
3      sanju
7     sukesh
2      suraj
1     suresh
dtype: object

In [81]:
print(s1.head())
print(s1.tail())

0    mukesh
1    suresh
2     suraj
3     sanju
4      ravi
dtype: object
3      sanju
4       ravi
5      lucky
6    sandeep
7     sukesh
dtype: object

In [84]:
print(s2.le(s3))
s3.le(s2)

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
dtype: bool

In [87]:
print(s2.ne(s1))
s3.ne(s1)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

In [88]:
s1.tolist()

['mukesh', 'suresh', 'suraj', 'sanju', 'ravi', 'lucky', 'sandeep', 'sukesh']

In [90]:
s2.get(s1.tolist())